tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
/*
  stm32flash - Open Source ST STM32 flash program for *nix
  Copyright (C) 2010 Geoffrey McRae <geoff@spacevs.com>

  This program is free software; you can redistribute it and/or
  modify it under the terms of the GNU General Public License
  as published by the Free Software Foundation; either version 2
  of the License, or (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
  
  for arduino modify by huaweiwx@sina.com 2017.10
*/


#ifndef _DEVTABLE_H_
#define _DEVTABLE_H_

// #define USE_STM32NAME 

typedef enum {
	F_NO_ME = 1 << 0,	/* Mass-Erase not supported */
	F_OBLL  = 1 << 1,	/* OBL_LAUNCH required */
} flags_t;

typedef struct stm32_dev	stm32_dev_t;

struct stm32_dev {
	uint16_t	id;
#ifdef USE_STM32NAME
	const char	*name;
#endif	
	uint32_t	ram_start, ram_end;
	uint32_t	fl_start, fl_end;
	uint16_t	fl_pps; // pages per sector
	uint32_t	*fl_ps;  // page size
	uint32_t	opt_start, opt_end;
	uint32_t	mem_start, mem_end;
	uint32_t	flags;
};


typedef struct chipInfo chipInfo_t;

struct chipInfo {
	uint32_t	ramEnd;
	uint32_t	flashEnd;
	uint16_t	flashPPS; // pages per sector
	uint32_t	*flashPS;  // page size
	uint32_t	optStart, optEnd;
	uint32_t	sysMemStart, sysMemEnd;
	uint32_t	flags;
};

extern chipInfo_t *pChipInfo;

//extern const stm32_dev_t devices;

#ifdef __cplusplus
extern "C" {
#endif

stm32_dev_t* UTIL_getStmDev(uint16_t id);


#ifdef __cplusplus
} //exter "C" {
#endif



#if defined(STM32F030C6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444
  
#elif defined(STM32F030C8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F030CC)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F030F4)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F030K6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F030R8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F030RC)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F070C6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445
 
#elif defined(STM32F070CB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F070F6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F070RB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F031C4)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F031C6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F031E6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F031F4)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F031F6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F031G4)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F031G6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F031K4)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F031K6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F051C4)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051C6)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051C8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051K4)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051K6)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051K8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051R4)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051R6)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051R8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F051T8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx 
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F071C8)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx   
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F071CB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx   
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F071RB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx   
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F071V8)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx   
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F071VB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx   
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F091CB)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F091CC)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F091RB)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F091RC)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F091VB)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F091VC)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

