tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32F042C4)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F042C6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F042F4)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F042F6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F042G4)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F042G6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F042K4)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F042K6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F042T6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F072C8)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F072CB)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F072R8)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F072RB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F072V8)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F072VB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F038C6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F038E6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F038F6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F038G6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F038K6)
  #define CHIO_ID 0x444 //STM32F03xx4/6
  #define CHIP_INFO CHIP_ID444

#elif defined(STM32F048C6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F048G6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F048T6)
  #define CHIO_ID 0x445 //STM32F04xxx/F070x6
  #define CHIP_INFO CHIP_ID445

#elif defined(STM32F058C8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F058R8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F058T8)
  #define CHIO_ID 0x440 //STM32F030x8/F05xxx
  #define CHIP_INFO CHIP_ID440

#elif defined(STM32F078CB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F078RB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F078VB)
  #define CHIO_ID 0x448 //STM32F070xB/F071xx/F72xx
  #define CHIP_INFO CHIP_ID448

#elif defined(STM32F098CC)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F098RC)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F098VC)
  #define CHIO_ID 0x442 //STM32F030xC/F09xxx  
  #define CHIP_INFO CHIP_ID442

#elif defined(STM32F100C4)
  #define CHIO_ID 0x412  //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F100C6)
  #define CHIO_ID 0x412  //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F100C8)
  #define CHIO_ID 0x420 //STM32F10xxx Medium-density VL
  #define CHIP_INFO CHIP_ID420

#elif defined(STM32F100CB)
  #define CHIO_ID 0x420 //STM32F10xxx Medium-density VL
  #define CHIP_INFO CHIP_ID420

#elif defined(STM32F100R4)
  #define CHIO_ID 0x412  //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F100R6)
  #define CHIO_ID 0x412  //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F100R8)
  #define CHIO_ID 0x420 //STM32F10xxx Medium-density VL
  #define CHIP_INFO CHIP_ID420

#elif defined(STM32F100RB)
  #define CHIO_ID 0x420 //STM32F10xxx Medium-density VL
  #define CHIP_INFO CHIP_ID420

#elif defined(STM32F100RC)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F100RD)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F100RE)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F100V8)
  #define CHIO_ID 0x420 //STM32F10xxx Medium-density VL
  #define CHIP_INFO CHIP_ID420

#elif defined(STM32F100VB)
  #define CHIO_ID 0x420 //STM32F10xxx Medium-density VL
  #define CHIP_INFO CHIP_ID420

#elif defined(STM32F100VC)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F100VD)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F100VE)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F100ZC)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F100ZD)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F100ZE)
  #define CHIO_ID 0x428 //STM32F10xxx High-density VL
  #define CHIP_INFO CHIP_ID428

#elif defined(STM32F101C4)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F101C6)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F101C8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F101CB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F101R4)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F101R6)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

