tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32F101R8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F101RB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F101RC)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101RD)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101RE)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101RF)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101RG)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101T4)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F101T6)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F101T8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F101TB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F101V8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F101VB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F101VC)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101VD)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101VE)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101VF)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101VG)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101ZC)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101ZD)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101ZE)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101ZF)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F101ZG)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F102C4)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F102C6)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F102C8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F102CB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F102R4)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F102R6)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F102R8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F102RB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103C4)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F103C6)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F103C8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103CB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103R4)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F103R6)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F103R8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103RB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103RC)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F103RD)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F103RE)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F103RF)
  #define CHIO_ID 0x430 //STM32F10xxx XL-density
  #define CHIP_INFO CHIP_ID430

#elif defined(STM32F103RG)
  #define CHIO_ID 0x430 //STM32F10xxx XL-density
  #define CHIP_INFO CHIP_ID430

#elif defined(STM32F103T4)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F103T6)
  #define CHIO_ID 0x412 //STM32F10xxx Low-density
  #define CHIP_INFO CHIP_ID412

#elif defined(STM32F103T8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103TB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103V8)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103VB)
  #define CHIO_ID 0x410 //STM32F10xxx Medium-density" 
  #define CHIP_INFO CHIP_ID410

#elif defined(STM32F103VC)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F103VD)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F103VE)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F103VF)
  #define CHIO_ID 0x430 //STM32F10xxx XL-density
  #define CHIP_INFO CHIP_ID430

#elif defined(STM32F103VG)
  #define CHIO_ID 0x430 //STM32F10xxx XL-density
  #define CHIP_INFO CHIP_ID430

#elif defined(STM32F103ZC)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F103ZD)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

