tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32F103ZE)
  #define CHIO_ID 0x414 //STM32F10xxx High-density
  #define CHIP_INFO CHIP_ID414

#elif defined(STM32F103ZF)
  #define CHIO_ID 0x430 //STM32F10xxx XL-density
  #define CHIP_INFO CHIP_ID430

#elif defined(STM32F103ZG)
  #define CHIO_ID 0x430 //STM32F10xxx XL-density
  #define CHIP_INFO CHIP_ID430

#elif defined(STM32F105R8)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F105RB)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F105RC)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F105V8)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F105VB)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F105VC)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F107RB)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F107RC)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F107VB)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F107VC)
  #define CHIO_ID 0x418 //STM32F105xx/F107xx
  #define CHIP_INFO CHIP_ID418

#elif defined(STM32F205RB)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205RC)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205RE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205RF)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205RG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205VB)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205VC)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205VE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205VF)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205VG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205ZC)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205ZE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205ZF)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F205ZG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F215RE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F215RG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F215VE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F215VG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F215ZE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F215ZG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207IC)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207IE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207IF)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207IG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207VC)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207VE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207VF)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207VG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207ZC)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207ZE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207ZF)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F207ZG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F217IE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F217IG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F217VE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F217VG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F217ZE)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F217ZG)
  #define CHIO_ID 0x411  //STM32F2xxxx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F301C6)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F301C8)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F301K6)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F301K8)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F301R6)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F301R8)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F302C6)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F302C8)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID411

#elif defined(STM32F302CB)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F302CC)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422
 
