tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32F302K6)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID439

#elif defined(STM32F302K8)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID439

#elif defined(STM32F302R6)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID439

#elif defined(STM32F302R8)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID439

#elif defined(STM32F302RB)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F302RC)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F302RD)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F302RE)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F302VB)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F302VC)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F302VD)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F302VE)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F302ZD)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F302ZE)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F303C6)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F303C8)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F303CB)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F303CC)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F303K6)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F303K8)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F303R6)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F303R8)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F303RB)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F303RC)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F303RD)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F303RE)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F303VB)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F303VC)
  #define CHIO_ID 0x422 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID422

#elif defined(STM32F303VD)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F303VE)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F303ZD)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F303ZE)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F334C4)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F334C6)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F334C8)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F334K4)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F334K6)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F334K8)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F334R6)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F334R8)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F373C8)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F373CB)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F373CC)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F373R8)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F373RB)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F373RC)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F373V8)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F373VB)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F373VC)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F318C8)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID439

#elif defined(STM32F318K8)
  #define CHIO_ID 0x439 //STM32F301xx/F302x4(6/8)/F318xx
  #define CHIP_INFO CHIP_ID439

#elif defined(STM32F328C8)
  #define CHIO_ID 0x438 //STM32F303x4(6/8)/F334xx/F328xx
  #define CHIP_INFO CHIP_ID438

#elif defined(STM32F358CC)
  #define CHIO_ID 0x458 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID458

