tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32F358RC)
  #define CHIO_ID 0x458 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID458

#elif defined(STM32F358VC)
  #define CHIO_ID 0x458 //STM32F302xB(C)/F303xB(C)/F358xx
  #define CHIP_INFO CHIP_ID458

#elif defined(STM32F378CC)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F378RC)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F378VC)
  #define CHIO_ID 0x432 //STM32F373xx/F378xx
  #define CHIP_INFO CHIP_ID432

#elif defined(STM32F398VE)
  #define CHIO_ID 0x446 //STM32F302xD(E)/F303xD(E)/F398xx
  #define CHIP_INFO CHIP_ID446

#elif defined(STM32F401CB)
  #define CHIO_ID 0x423 //STM32F401xB(C)
  #define CHIP_INFO CHIP_ID423

#elif defined(STM32F401CC)
  #define CHIO_ID 0x423 //STM32F401xB(C)
  #define CHIP_INFO CHIP_ID423

#elif defined(STM32F401CD)
  #define CHIO_ID 0x433 //STM32F401xD(E)
  #define CHIP_INFO CHIP_ID433

#elif defined(STM32F401CE)
  #define CHIO_ID 0x433 //STM32F401xD(E)
  #define CHIP_INFO CHIP_ID433

#elif defined(STM32F401RB)
  #define CHIO_ID 0x423 //STM32F401xB(C)
  #define CHIP_INFO CHIP_ID423

#elif defined(STM32F401RC)
  #define CHIO_ID 0x423 //STM32F401xB(C)
  #define CHIP_INFO CHIP_ID423

#elif defined(STM32F401RD)
  #define CHIO_ID 0x433 //STM32F401xD(E)
  #define CHIP_INFO CHIP_ID433

#elif defined(STM32F401RE)
  #define CHIO_ID 0x433 //STM32F401xD(E)
  #define CHIP_INFO CHIP_ID433

#elif defined(STM32F401VB)
  #define CHIO_ID 0x423 //STM32F401xB(C)
  #define CHIP_INFO CHIP_ID423

#elif defined(STM32F401VC)
  #define CHIO_ID 0x423 //STM32F401xB(C)
  #define CHIP_INFO CHIP_ID423

#elif defined(STM32F401VD)
  #define CHIO_ID 0x433 //STM32F401xD(E)
  #define CHIP_INFO CHIP_ID433

#elif defined(STM32F401VE)
  #define CHIO_ID 0x433 //STM32F401xD(E)
  #define CHIP_INFO CHIP_ID433

#elif defined(STM32F405OE)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F405OG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F405RG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F405VG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F405ZG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F415OG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F415RG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F415VG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F415ZG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F407IE)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F407IG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F407VE)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F407VG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F407ZE)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F407ZG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F417IE)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F417IG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F417VE)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F417VG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F417ZE)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F417ZG)
  #define CHIO_ID 0x413 //STM32F40xxx/41xxx
  #define CHIP_INFO CHIP_ID413

#elif defined(STM32F410C8)
  #define CHIO_ID 0x458 //STM32F410xx
  #define CHIP_INFO CHIP_ID458

#elif defined(STM32F410CB)
  #define CHIO_ID 0x458 //STM32F410xx
  #define CHIP_INFO CHIP_ID458

#elif defined(STM32F410R8)
  #define CHIO_ID 0x458 //STM32F410xx
  #define CHIP_INFO CHIP_ID458

#elif defined(STM32F410RB)
  #define CHIO_ID 0x458 //STM32F410xx
  #define CHIP_INFO CHIP_ID458

#elif defined(STM32F410T8)
  #define CHIO_ID 0x458 //STM32F410xx
  #define CHIP_INFO CHIP_ID458

#elif defined(STM32F410TB)
  #define CHIO_ID 0x458 //STM32F410xx
  #define CHIP_INFO CHIP_ID458

#elif defined(STM32F411CC)
  #define CHIO_ID 0x431 //STM32F411xx
  #define CHIP_INFO CHIP_ID431

#elif defined(STM32F411CE)
  #define CHIO_ID 0x431 //STM32F411xx
  #define CHIP_INFO CHIP_ID431

#elif defined(STM32F411RC)
  #define CHIO_ID 0x431 //STM32F411xx
  #define CHIP_INFO CHIP_ID431

#elif defined(STM32F411RE)
  #define CHIO_ID 0x431 //STM32F411xx
  #define CHIP_INFO CHIP_ID431

#elif defined(STM32F411VC)
  #define CHIO_ID 0x431 //STM32F411xx
  #define CHIP_INFO CHIP_ID431

#elif defined(STM32F411VE)
  #define CHIO_ID 0x431 //STM32F411xx
  #define CHIP_INFO CHIP_ID431

#elif defined(STM32F412CE)
  #define CHIO_ID 0x441  //STM32F412xx
  #define CHIP_INFO CHIP_ID441

#elif defined(STM32F412CG)
  #define CHIO_ID 0x441  //STM32F412xx
  #define CHIP_INFO CHIP_ID441

#elif defined(STM32F412RE)
  #define CHIO_ID 0x441  //STM32F412xx
  #define CHIP_INFO CHIP_ID441

#elif defined(STM32F412RG)
  #define CHIO_ID 0x441  //STM32F412xx
  #define CHIP_INFO CHIP_ID441

#elif defined(STM32F412VE)
  #define CHIO_ID 0x441  //STM32F412xx
  #define CHIP_INFO CHIP_ID441

#elif defined(STM32F412VG)
  #define CHIO_ID 0x441  //STM32F412xx
  #define CHIP_INFO CHIP_ID441

#elif defined(STM32F412ZE)
  #define CHIO_ID 0x441  //STM32F412xx
  #define CHIP_INFO CHIP_ID441

#elif defined(STM32F412ZG)
  #define CHIO_ID 0x441  //STM32F412xx
  #define CHIP_INFO CHIP_ID441

#elif defined(STM32F413CG)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F413CH)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

