tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32F413MG)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F413MH)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F413RG)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F413RH)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F413VG)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F413VH)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F413ZG)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F413ZH)
  #define CHIO_ID 0x463 //STM32F413xx
  #define CHIP_INFO CHIP_ID463

#elif defined(STM32F423CH)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F423MH)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F423RH)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F423VH)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F423ZH)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F427AG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F427AI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F427IG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F427II)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F427VG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F427VI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F427ZG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F427ZI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F437AI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F437IG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F437II)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F437VG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F437VI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F437ZG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F437ZI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429AG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429AI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429BE)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429BG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429BI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429IE)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429IG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429II)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429NE)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429NG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429NI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429VE)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429VG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429VI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429ZE)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429ZG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F429ZI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439AI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439BG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439BI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439IG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439II)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439NG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439NI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439VG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439VI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439ZG)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F439ZI)
  #define CHIO_ID 0x419 //STM32F42xxx/43xxx
  #define CHIP_INFO CHIP_ID419

#elif defined(STM32F446MC)
  #define CHIO_ID 0x421 //STM32F446xx
  #define CHIP_INFO CHIP_ID421

#elif defined(STM32F446ME)
  #define CHIO_ID 0x421 //STM32F446xx
  #define CHIP_INFO CHIP_ID421

#elif defined(STM32F446RC)
  #define CHIO_ID 0x421 //STM32F446xx
  #define CHIP_INFO CHIP_ID421

#elif defined(STM32F446RE)
  #define CHIO_ID 0x421 //STM32F446xx
  #define CHIP_INFO CHIP_ID421

#elif defined(STM32F446VC)
  #define CHIO_ID 0x421 //STM32F446xx
  #define CHIP_INFO CHIP_ID421

#elif defined(STM32F446VE)
  #define CHIO_ID 0x421 //STM32F446xx
  #define CHIP_INFO CHIP_ID421

#elif defined(STM32F446ZC)
  #define CHIO_ID 0x421 //STM32F446xx
  #define CHIP_INFO CHIP_ID421

#elif defined(STM32F446ZE)
  #define CHIO_ID 0x421 //STM32F446xx
  #define CHIP_INFO CHIP_ID421

#elif defined(STM32F469AE)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

