tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32F469AG)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469AI)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469BE)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469BG)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469BI)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469IE)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469IG)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469II)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469NE)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469NG)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469NI)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469VE)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469VG)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469VI)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469ZE)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469ZG)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F469ZI)
  #define CHIO_ID 0x434 //STM32F469xx
  #define CHIP_INFO CHIP_ID434

#elif defined(STM32F479AG)

#elif defined(STM32F479AI)

#elif defined(STM32F479BG)

#elif defined(STM32F479BI)

#elif defined(STM32F479IG)

#elif defined(STM32F479II)

#elif defined(STM32F479NG)

#elif defined(STM32F479NI)

#elif defined(STM32F479VG)

#elif defined(STM32F479VI)

#elif defined(STM32F479ZG)

#elif defined(STM32F479ZI)

#elif defined(STM32F722IC)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F722IE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F722RC)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F722RE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F722VC)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F722VE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F722ZC)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F722ZE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F732IE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F732RE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F732VE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F732ZE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F723IC)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F723IE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F723VC)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F723VE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F723ZC)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F723ZE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F733IE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F733VE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F733ZE)
  #define CHIO_ID 0x452 //STM32F72xxx/73xxx
  #define CHIP_INFO CHIP_ID452

#elif defined(STM32F745IE)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F745IG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F745VE)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F745VG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F745ZE)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F745ZG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F765BG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765BI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765IG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765II)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765NG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765NI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765VG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765VI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765ZG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F765ZI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F746BE)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F746BG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F746IE)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

