tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32F746IG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F746NE)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F746NG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F746VE)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F746VG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F746ZE)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F746ZG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F756BG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F756IG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F756NG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F756VG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F756ZG)
  #define CHIO_ID 0x449 //STM32F74xxx/75xxx
  #define CHIP_INFO CHIP_ID449

#elif defined(STM32F767BG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767BI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767IG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767II)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767NG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767NI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767VG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767VI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767ZG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F767ZI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F777BI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F777II)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F777NI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F777VI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F777ZI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F768AI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F778AI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F769AG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F769AI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F769BG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F769BI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F769IG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F769II)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F769NG)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F769NI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F779AI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F779BI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F779II)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32F779NI)
  #define CHIO_ID 0x451 //STM32F76xxx/77xxx
  #define CHIP_INFO CHIP_ID451

#elif defined(STM32L011D3)

#elif defined(STM32L011D4)

#elif defined(STM32L011E3)

#elif defined(STM32L011E4)

#elif defined(STM32L011F3)

#elif defined(STM32L011F4)

#elif defined(STM32L011G3)

#elif defined(STM32L011G4)

#elif defined(STM32L011K3)

#elif defined(STM32L011K4)

#elif defined(STM32L021D4)

#elif defined(STM32L021F4)

#elif defined(STM32L021G4)

#elif defined(STM32L021K4)

#elif defined(STM32L031C4)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031C6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031E4)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031E6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031F4)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031F6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031G4)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031G6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031K4)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L031K6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L041C4)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L041C6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L041E6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L041F6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L041G6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L041K6)
  #define CHIO_ID 0x425 //STM32L031xx/041xx
  #define CHIP_INFO CHIP_ID425

#elif defined(STM32L051C6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx"
  #define CHIP_INFO CHIP_ID417

