tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32L051C8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx"
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L051K6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx"
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L051K8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx"
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L051R6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx"
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L051R8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx"
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L051T6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx"
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L051T8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx"
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L071CB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071CZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071C8)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071KB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071KZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071K8)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071RB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071RZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071VB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071VZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L071V8)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L081CZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L081KZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L052C6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L052C8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L052K6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L052K8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L052R6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L052R8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L052T6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L052T8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L062K8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L072CB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L072CZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L072KB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L072KZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L072RB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L072RZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L072VB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L072VZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L072V8)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L082CZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L082KB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L082KZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L053C6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L053C8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L053R6)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L053R8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L063C8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L063R8)
  #define CHIO_ID 0x417 //STM32L05xxx/06xxx
  #define CHIP_INFO CHIP_ID417

#elif defined(STM32L073CB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L073CZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L073RB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L073RZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L073VB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L073VZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L073V8)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L083CB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L083CZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L083RB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L083RZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L083VB)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

