tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32L083VZ)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L083V8)
  #define CHIO_ID 0x447 //STM32L07xxx/08xxx
  #define CHIP_INFO CHIP_ID447

#elif defined(STM32L100C6)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L100R8)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L100RB)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L100RC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L151C6)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L151C8)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L151CB)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L151CC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L151QC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L151QD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L151QE)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L151R6)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L151R8)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L151RB)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L151RC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L151RD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L151RE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L151UC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L151V8)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L151VB)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L151VC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L151VD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L151VE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L151ZC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L151ZD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L151ZE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L152C6)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L152C8)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L152CB)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L152CC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L152QC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L152QD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L152QE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L152R6)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L152R8)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L152RB)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L152RC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L152RD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L152RE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L152V8)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L152VB)
  #define CHIO_ID 0x416 //STM32L1xxx6(8/B)
  #define CHIP_INFO CHIP_ID416

#elif defined(STM32L152VC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L152VD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L152VE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L152ZC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L152ZD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L152ZE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L162QD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L162RC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L162RD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L162RE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L162VC)
  #define CHIO_ID 0x427 //STM32L1xxxC
  #define CHIP_INFO CHIP_ID427

#elif defined(STM32L162VD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L162VE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L162ZD)
  #define CHIO_ID 0x436 //STM32L1xxxD
  #define CHIP_INFO CHIP_ID436

#elif defined(STM32L162ZE)
  #define CHIO_ID 0x437 //STM32L1xxxE
  #define CHIP_INFO CHIP_ID437

#elif defined(STM32L431CB)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L431CC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L431KB)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L431KC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L431RB)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

