tony-cloud/STM32_duino/STM32/libraries/UTILS/src/dev_table.h
#elif defined(STM32L431RC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L431VC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L451CC)

#elif defined(STM32L451CE)

#elif defined(STM32L451RC)

#elif defined(STM32L451RE)

#elif defined(STM32L451VC)

#elif defined(STM32L451VE)

#elif defined(STM32L471QE)
  #define CHIO_ID 0x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L471QG)
  #define CHIO_ID 0x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L471RE)
  #define CHIO_ID 0x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L471RG)
  #define CHIO_ID 0x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L471VE)
  #define CHIO_ID 0x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L471VG)
  #define CHIO_ID 0x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L471ZE)
  #define CHIO_ID 0x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L471ZG)
  #define CHIO_ID 0x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L432KB)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L432KC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L442KC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L452CC)
 
#elif defined(STM32L452CE)
 
#elif defined(STM32L452RC)
 
#elif defined(STM32L452RE)
 
#elif defined(STM32L452VC)
 
#elif defined(STM32L452VE)
 
#elif defined(STM32L462CE)

#elif defined(STM32L462RE)
 
#elif defined(STM32L462VE)
 
#elif defined(STM32L433CB)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L433CC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L433RB)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L433RC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L433VC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L443CC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L443RC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L443VC)
  #define CHIO_ID 0x435 //STM32L43xxx/44xxx
  #define CHIP_INFO CHIP_ID435

#elif defined(STM32L475RC)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L475RE)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L475RG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L475VC)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L475VE)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L475VG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L485JC)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L485JE)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476JE)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476JG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476ME)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476MG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476QE)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476QG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476RC)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476RE)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476RG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476VC)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476VE)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476VG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476ZE)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L476ZG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L486JG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L486QG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L486RG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L486VG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L486ZG)
  #define CHIO_ID 00x415 //STM32L47xxx/48xxx
  #define CHIP_INFO CHIP_ID415

#elif defined(STM32L496AE)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496AG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496QE)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496QG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496RE)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496RG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496VE)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496VG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496ZE)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L496ZG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L4A6AG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L4A6QG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L4A6RG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L4A6VG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#elif defined(STM32L4A6ZG)
  #define CHIO_ID 0x461 //STM32L496xx/4A6xx" 
  #define CHIP_INFO CHIP_ID461

#else 
#error   UNKNOWN CHIP PLEASE FIXED ME
#endif


#endif

